database/seeders/PermissionsSeeder.php

    public function run()
    {
        $permissions = [
            'apikey'            => ['manage', 'create', 'edit', 'delete', 'export'],
            'apilog'            => ['manage', 'create', 'edit', 'delete', 'export'],
        ];



        $role = Role::firstOrCreate([
            'name' => 'Admin'
        ]);
        foreach ($permissions as $module => $adminpermission) {
            Module::firstOrCreate(['name' => $module]);
            foreach ($adminpermission as $permission) {
                $temp = Permission::firstOrCreate(['name' => $permission . '-' . $module]);
---
select * from `roles` where (`name` = 'Admin') limit 1
insert into `modules` (`name`, `updated_at`, `created_at`) values ('apikey', '2025-10-10 19:30:05', '2025-10-10 19:30:05')
select * from `modules` where (`name` = 'apikey') limit 1
insert into `permissions` (`guard_name`, `name`, `updated_at`, `created_at`) values ('web', 'manage-apikey', '2025-10-10 19:30:05', '2025-10-10 19:30:05')
select * from `permissions` where (`name` = 'manage-apikey') limit 1