app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request)
    {
        if (UtilityFacades::getsettings('login_recaptcha_status') == 1) {
            $validator = \Validator::make($request->all(), [
                'g-recaptcha-response' => 'required',
            ]);
            if ($validator->fails()) {
                return redirect()->back()->with('errors', __('Please check reCAPTCHA.'));
            }
        }
        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'admin@gmail.com' limit 1