app/Http/Controllers/Api/RcmsController.php

select `id`, `codigodepto`, `nombredepto` from `deptos`
---
    public function obtenerDeptosRCM()
    {
        $deptos = Depto::select('id', 'codigodepto', 'nombredepto')->get();

select `id`, `codigodepto`, `codigomunicipio`, `nombremunicipio` from `municipios` where `codigodepto` = '16'
---
    public function obtenerMunicipiosRCM($id = null)
    {
        $municipios = Municipio::select('id', 'codigodepto', 'codigomunicipio', 'nombremunicipio')->where('codigodepto', $id)->get();