app/Facades/Utility.php

    public function settings()
    {
        $data = DB::table('settings');
        $data = $data->get();
---
select * from `settings`