app/Http/Controllers/HomeController.php

select * from `roles` where `name` = 'Admin' limit 1
select count(*) as aggregate from `users` where `type` != 'Admin'
---
    public function index()
    {
        $usr = \Auth::user();
        $userId = $usr->id;
        $roles = Role::where('name', $usr->type)->first();
        $roleId = $usr->roles->first()->id;
        if ($usr->type == 'Admin') {
            $user = User::where('type', '!=',  'Admin')->count();