app/Http/Controllers/ParametrosController.php

select * from `parametros` where `parametros`.`id` = '1' limit 1
update `parametros` set `nombre` = 'Version2', `descripcion` = 'prueba de version2', `valor` = '1.1', `parametros`.`updated_at` = '2025-10-18 22:36:05' where `id` = 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'nombre'    => 'required',
            'valor'   => 'required',
        ]);

        $input = $request->all();

        $parametro = Parametros::find($id);
        $parametro->update($input);