app/Http/Controllers/RcmsController.php

select * from `deptos` order by `id` asc
select * from `municipios` order by `id` asc
---
    public function index(RcmsDataTable $dataTable)
    {
        $depto = DB::table("deptos")->orderBy('id', 'asc')->get();
        $deptos = [];
        $deptos[''] = __('Seleccione un Depto');
        foreach ($depto as $value) {
            $deptos[$value->id] = $value->nombredepto;
        }

        $municipio = DB::table("municipios")->orderBy('id', 'asc')->get();

select * from `deptos` order by `id` asc
select * from `municipios` order by `id` asc
select * from `clasificacion` order by `id` asc
---
    public function create()
    {
        $depto = DB::table("deptos")->orderBy('id', 'asc')->get();
        $deptos = [];
        $deptos[''] = __('Seleccione un Depto');
        foreach ($depto as $value) {
            $deptos[$value->id] = $value->nombredepto;
        }

        $municipio = DB::table("municipios")->orderBy('id', 'asc')->get();
        $municipios = [];
        $municipios[''] = __('Seleccione un Municipio');
        foreach ($municipio as $value) {
            $municipios[$value->id] = $value->nombremunicipio;
        }

        $clasificacion = DB::table("clasificacion")->orderBy('id', 'asc')->get();

insert into `rcms` (`codigo`, `name`, `id_clasificacion`, `telefono`, `latitud`, `longitud`, `direccion`, `idDepto`, `idMunicipio`, `foto`, `status`, `created_by`, `updated_at`, `created_at`) values ('050101', 'RNP', '1', '95525921', '15.490482454377362', '-88.03462325936232', 'Uno, 20 Calle SO, San Pedro Sula, Cortés, 21104, Honduras', '5', '63', 'C:\\xampp82_2024\\php\\tmp\\php9CE4.tmp', '1', 1, '2025-09-09 14:47:41', '2025-09-09 14:47:41')
---
    public function store(Request $request)
    {
        request()->validate([
            'codigo'         => 'required|max:10|unique:rcms,codigo',
            'idDepto'         => 'required',
            'idMunicipio'         => 'required',
        ]);

        $input               = $request->all();
        $input['status']     = '1';
        $input['created_by'] = \Auth::user()->id;
        $input['created_at'] =  Carbon::now()->toDateTimeString();

        if ($request->hasFile('foto') && $request->file('foto')->isValid()) {
            $file = $request->file('foto');
            $fileName  = $file->store('rcms');
            $input['foto'] = $fileName;
        }

        $rcm                       = Rcm::create($input);

select * from `rcms` where `rcms`.`id` = '2' limit 1
select * from `deptos` order by `id` asc
select * from `municipios` order by `id` asc
select * from `clasificacion` order by `id` asc
---
    public function edit($id)
    {

        $rcm           = Rcm::find($id);
        $depto = DB::table("deptos")->orderBy('id', 'asc')->get();
        $deptos = [];
        $deptos[''] = __('Seleccione un Depto');
        foreach ($depto as $value) {
            $deptos[$value->id] = $value->nombredepto;
        }

        $municipio = DB::table("municipios")->orderBy('id', 'asc')->get();
        $municipios = [];
        $municipios[''] = __('Seleccione un Municipio');
        foreach ($municipio as $value) {
            $municipios[$value->id] = $value->nombremunicipio;
        }

        $clasificacion = DB::table("clasificacion")->orderBy('id', 'asc')->get();

select * from `rcms` where `rcms`.`id` = '2' limit 1
update `rcms` set `direccion` = '18 Calle, San Pedro Sula, Cortés, 21101, Honduras', `foto` = 'rcms/1S6g1IZPCr1Fw7MOniBCxzfhuxr5DzmZdqBnskaY.png', `latitud` = '15.5028734', `longitud` = '-87.977781', `updated_by` = 1, `rcms`.`updated_at` = '2025-10-18 23:23:06' where `id` = 2
---
    public function update(Request $request, $id)
    {
        request()->validate([
            'codigo' => 'required|max:10|unique:rcms,codigo,' . $id,
            'iddepto' => 'required',
            'idmunicipio' => 'required',
        ]);

        $input               = $request->all();
        $input['status']     = '1';
        $input['updated_by'] = \Auth::user()->id;
        $input['updated_at'] =  Carbon::now()->toDateTimeString();

        if ($request->hasFile('foto') && $request->file('foto')->isValid()) {
            $file = $request->file('foto');
            $fileName  = $file->store('rcms');
            $input['foto'] = $fileName;
        }

        $rcm                    = Rcm::find($id);
        $rcm->update($input);