app/Http/Controllers/SearchController.php

select * from `municipios` where `codigodepto` = '5'
---
    public function obtenerMunicipiosPorDeptos($id)
    {
        $Municipios = DB::table('municipios')->where('codigodepto', $id)->get();