app/Http/Controllers/SettingsController.php

    public function smsSettingUpdate(Request $request)
    {
        if ($request->smssetting == 'twilio') {
            request()->validate([
                'twilio_sid' => 'required',
                'twilio_auth_token' => 'required',
                'twilio_verify_sid' => 'required',
                'twilio_number' => 'required',
            ]);
        } else if ($request->smssetting == 'nexmo') {
            request()->validate([
                'nexmo_key' => 'required',
                'nexmo_secret' => 'required',
            ]);
        }
        $data = [
            'multisms_setting' => ($request->multisms_setting) ? 'on' : 'off',
            'smssetting' => ($request->smssetting),
            'nexmo_key' => $request->nexmo_key,
            'nexmo_secret' => $request->nexmo_secret,
            'twilio_sid' => $request->twilio_sid,
            'twilio_auth_token' => $request->twilio_auth_token,
            'twilio_verify_sid' => $request->twilio_verify_sid,
            'twilio_number' => $request->twilio_number,
        ];
        $this->updateSettings($data);
---
update "SETTINGS" set "VALUE" = 'benigno.amaya1994@gmail.com' where "ID" = 111